aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx23e-a/register_access/gnuc/iodefine.h
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DSAD1	SYSTEM.MSTPCRA.BIT.MSTPA26
#define	MSTP_DSAD0	SYSTEM.MSTPCRA.BIT.MSTPA25
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_AFE	SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SMCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_RSCAN	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_RSCAN0	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RAM0	SYSTEM.MSTPCRC.BIT.MSTPC0

#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	AFE		(*(volatile struct st_afe         *)0xA1400)
#define	BSC		(*(volatile struct st_bsc         *)0x81300)
#define	CAC		(*(volatile struct st_cac         *)0x8B000)
#define	CMT		(*(volatile struct st_cmt         *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0        *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0        *)0x88008)
#define	CRC		(*(volatile struct st_crc         *)0x88280)
#define	DMAC	(*(volatile struct st_dmac        *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0       *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1       *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1       *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1       *)0x820C0)
#define	DOC		(*(volatile struct st_doc         *)0x8B080)
#define	DSAD0	(*(volatile struct st_dsad        *)0xA1000)
#define	DSAD1	(*(volatile struct st_dsad        *)0xA1200)
#define	DTC		(*(volatile struct st_dtc         *)0x82400)
#define	ELC		(*(volatile struct st_elc         *)0x8B100)
#define	FLASH	(*(volatile struct st_flash       *)0x7FC090)
#define	FLASHCONST		(*(volatile struct st_flashconst  *)0x7FC350)
#define	ICU		(*(volatile struct st_icu         *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt        *)0x88030)
#define	LPT		(*(volatile struct st_lpt         *)0x800B0)
#define	MPC		(*(volatile struct st_mpc         *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu         *)0x86400)
#define	MTU		(*(volatile struct st_mtu         *)0xD0A0A)
#define	MTU0	(*(volatile struct st_mtu0        *)0xD0A90)
#define	MTU1	(*(volatile struct st_mtu1        *)0xD0A90)
#define	MTU2	(*(volatile struct st_mtu2        *)0xD0A92)
#define	MTU3	(*(volatile struct st_mtu3        *)0xD0A00)
#define	MTU4	(*(volatile struct st_mtu4        *)0xD0A00)
#define	MTU5	(*(volatile struct st_mtu5        *)0xD0A94)
#define	OFSM	(*(volatile struct st_ofsm        *)0xFFFFFF80)
#define	POE		(*(volatile struct st_poe         *)0x88900)
#define	PORT1	(*(volatile struct st_port1       *)0x8C001)
#define	PORT2	(*(volatile struct st_port2       *)0x8C002)
#define	PORT3	(*(volatile struct st_port3       *)0x8C003)
#define	PORTB	(*(volatile struct st_portb       *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc       *)0x8C00C)
#define	PORTH	(*(volatile struct st_porth       *)0x8C011)
#define	RIIC0	(*(volatile struct st_riic        *)0x88300)
#define	RSCAN	(*(volatile struct st_rscan       *)0xA8322)
#define	RSCAN0	(*(volatile struct st_rscan0      *)0xA8300)
#define	RSPI0	(*(volatile struct st_rspi        *)0x88380)
#define	S12AD	(*(volatile struct st_s12ad       *)0x89000)
#define	SCI1	(*(volatile struct st_sci1        *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1        *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci1        *)0x8A0C0)
#define	SCI12	(*(volatile struct st_sci12       *)0x8B300)
#define	SMCI1	(*(volatile struct st_smci        *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci        *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci        *)0x8A0C0)
#define	SMCI12	(*(volatile struct st_smci        *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system      *)0x80000)
#define	TMR0	(*(volatile struct st_tmr0        *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1        *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0        *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1        *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01       *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01       *)0x88214)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_FCU_FRDYI=23,
IR_ICU_SWINT=27,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CAC_FERRF=32,IR_CAC_MENDF,IR_CAC_OVFF,
IR_RSPI0_SPEI0=44,IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,IR_RSPI0_SPII0,
IR_RSCAN_COMFRXINT=52,IR_RSCAN_RXFINT,IR_RSCAN_TXINT,IR_RSCAN_CHERRINT,IR_RSCAN_GLERRINT,
IR_DOC_DOPCF,
IR_ICU_IRQ0=64,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_ELC_ELSR8I=80,
IR_LVD_LVD1=88,IR_LVD_LVD2,
IR_S12AD_S12ADI0=102,IR_S12AD_GBADI,
IR_ELC_ELSR18I=106,IR_ELC_ELSR19I,
IR_MTU0_TGIA0=114,IR_MTU0_TGIB0,IR_MTU0_TGIC0,IR_MTU0_TGID0,IR_MTU0_TCIV0,IR_MTU0_TGIE0,IR_MTU0_TGIF0,
IR_MTU1_TGIA1,IR_MTU1_TGIB1,IR_MTU1_TCIV1,IR_MTU1_TCIU1,
IR_MTU2_TGIA2,IR_MTU2_TGIB2,IR_MTU2_TCIV2,IR_MTU2_TCIU2,
IR_MTU3_TGIA3,IR_MTU3_TGIB3,IR_MTU3_TGIC3,IR_MTU3_TGID3,IR_MTU3_TCIV3,
IR_MTU4_TGIA4,IR_MTU4_TGIB4,IR_MTU4_TGIC4,IR_MTU4_TGID4,IR_MTU4_TCIV4,
IR_MTU5_TGIU5,IR_MTU5_TGIV5,IR_MTU5_TGIW5,
IR_POE_OEI1=170,IR_POE_OEI2,
IR_TMR0_CMIA0=174,IR_TMR0_CMIB0,IR_TMR0_OVI0,
IR_TMR1_CMIA1,IR_TMR1_CMIB1,IR_TMR1_OVI1,
IR_TMR2_CMIA2,IR_TMR2_CMIB2,IR_TMR2_OVI2,
IR_TMR3_CMIA3,IR_TMR3_CMIB3,IR_TMR3_OVI3,
IR_DMAC_DMAC0I=198,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,
IR_DSAD0_ADI0=206,IR_DSAD0_SCANEND0,
IR_DSAD1_ADI1=209,IR_DSAD1_SCANEND1,
IR_SCI1_ERI1=218,IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_SCI5_ERI5,IR_SCI5_RXI5,IR_SCI5_TXI5,IR_SCI5_TEI5,
IR_SCI6_ERI6,IR_SCI6_RXI6,IR_SCI6_TXI6,IR_SCI6_TEI6,
IR_SCI12_ERI12=238,IR_SCI12_RXI12,IR_SCI12_TXI12,IR_SCI12_TEI12,IR_SCI12_SCIX0,IR_SCI12_SCIX1,IR_SCI12_SCIX2,IR_SCI12_SCIX3,
IR_RIIC0_EEI0,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0
} enum_ir_t;

