aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx23e-a/register_access/gnuc/iodefine.h
typedef enum enum_dtce {
DTCE_ICU_SWINT=27,
DTCE_CMT0_CMI0,
DTCE_CMT1_CMI1,
DTCE_RSPI0_SPRI0=45,DTCE_RSPI0_SPTI0,
DTCE_RSCAN_COMFRXINT=52,
DTCE_ICU_IRQ0=64,DTCE_ICU_IRQ1,DTCE_ICU_IRQ2,DTCE_ICU_IRQ3,DTCE_ICU_IRQ4,DTCE_ICU_IRQ5,DTCE_ICU_IRQ6,DTCE_ICU_IRQ7,
DTCE_S12AD_S12ADI0=102,DTCE_S12AD_GBADI,
DTCE_ELC_ELSR18I=106,DTCE_ELC_ELSR19I,
DTCE_MTU0_TGIA0=114,DTCE_MTU0_TGIB0,DTCE_MTU0_TGIC0,DTCE_MTU0_TGID0,
DTCE_MTU1_TGIA1=121,DTCE_MTU1_TGIB1,
DTCE_MTU2_TGIA2=125,DTCE_MTU2_TGIB2,
DTCE_MTU3_TGIA3=129,DTCE_MTU3_TGIB3,DTCE_MTU3_TGIC3,DTCE_MTU3_TGID3,
DTCE_MTU4_TGIA4=134,DTCE_MTU4_TGIB4,DTCE_MTU4_TGIC4,DTCE_MTU4_TGID4,DTCE_MTU4_TCIV4,
DTCE_MTU5_TGIU5,DTCE_MTU5_TGIV5,DTCE_MTU5_TGIW5,
DTCE_TMR0_CMIA0=174,DTCE_TMR0_CMIB0,
DTCE_TMR1_CMIA1=177,DTCE_TMR1_CMIB1,
DTCE_TMR2_CMIA2=180,DTCE_TMR2_CMIB2,
DTCE_TMR3_CMIA3=183,DTCE_TMR3_CMIB3,
DTCE_DMAC_DMAC0I=198,DTCE_DMAC_DMAC1I,DTCE_DMAC_DMAC2I,DTCE_DMAC_DMAC3I,
DTCE_DSAD0_ADI0=206,DTCE_DSAD0_SCANEND0,
DTCE_DSAD1_ADI1=209,DTCE_DSAD1_SCANEND1,
DTCE_SCI1_RXI1=219,DTCE_SCI1_TXI1,
DTCE_SCI5_RXI5=223,DTCE_SCI5_TXI5,
DTCE_SCI6_RXI6=227,DTCE_SCI6_TXI6,
DTCE_SCI12_RXI12=239,DTCE_SCI12_TXI12,
DTCE_RIIC0_RXI0=247,DTCE_RIIC0_TXI0
} enum_dtce_t;

typedef enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_FCU_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_RSPI0_SPEI0=0x05,IER_RSPI0_SPRI0=0x05,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_RSCAN_COMFRXINT=0x06,IER_RSCAN_RXFINT=0x06,IER_RSCAN_TXINT=0x06,IER_RSCAN_CHERRINT=0x06,IER_RSCAN_GLERRINT=0x07,
IER_DOC_DOPCF=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_ELC_ELSR8I=0x0A,
IER_LVD_LVD1=0x0B,IER_LVD_LVD2=0x0B,
IER_S12AD_S12ADI0=0x0C,IER_S12AD_GBADI=0x0C,
IER_ELC_ELSR18I=0x0D,IER_ELC_ELSR19I=0x0D,
IER_MTU0_TGIA0=0x0E,IER_MTU0_TGIB0=0x0E,IER_MTU0_TGIC0=0x0E,IER_MTU0_TGID0=0x0E,IER_MTU0_TCIV0=0x0E,IER_MTU0_TGIE0=0x0E,IER_MTU0_TGIF0=0x0F,
IER_MTU1_TGIA1=0x0F,IER_MTU1_TGIB1=0x0F,IER_MTU1_TCIV1=0x0F,IER_MTU1_TCIU1=0x0F,
IER_MTU2_TGIA2=0x0F,IER_MTU2_TGIB2=0x0F,IER_MTU2_TCIV2=0x0F,IER_MTU2_TCIU2=0x10,
IER_MTU3_TGIA3=0x10,IER_MTU3_TGIB3=0x10,IER_MTU3_TGIC3=0x10,IER_MTU3_TGID3=0x10,IER_MTU3_TCIV3=0x10,
IER_MTU4_TGIA4=0x10,IER_MTU4_TGIB4=0x10,IER_MTU4_TGIC4=0x11,IER_MTU4_TGID4=0x11,IER_MTU4_TCIV4=0x11,
IER_MTU5_TGIU5=0x11,IER_MTU5_TGIV5=0x11,IER_MTU5_TGIW5=0x11,
IER_POE_OEI1=0x15,IER_POE_OEI2=0x15,
IER_TMR0_CMIA0=0x15,IER_TMR0_CMIB0=0x15,IER_TMR0_OVI0=0x16,
IER_TMR1_CMIA1=0x16,IER_TMR1_CMIB1=0x16,IER_TMR1_OVI1=0x16,
IER_TMR2_CMIA2=0x16,IER_TMR2_CMIB2=0x16,IER_TMR2_OVI2=0x16,
IER_TMR3_CMIA3=0x16,IER_TMR3_CMIB3=0x17,IER_TMR3_OVI3=0x17,
IER_DMAC_DMAC0I=0x18,IER_DMAC_DMAC1I=0x18,IER_DMAC_DMAC2I=0x19,IER_DMAC_DMAC3I=0x19,
IER_DSAD0_ADI0=0x19,IER_DSAD0_SCANEND0=0x19,
IER_DSAD1_ADI1=0x1A,IER_DSAD1_SCANEND1=0x1A,
IER_SCI1_ERI1=0x1B,IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI5_ERI5=0x1B,IER_SCI5_RXI5=0x1B,IER_SCI5_TXI5=0x1C,IER_SCI5_TEI5=0x1C,
IER_SCI6_ERI6=0x1C,IER_SCI6_RXI6=0x1C,IER_SCI6_TXI6=0x1C,IER_SCI6_TEI6=0x1C,
IER_SCI12_ERI12=0x1D,IER_SCI12_RXI12=0x1D,IER_SCI12_TXI12=0x1E,IER_SCI12_TEI12=0x1E,IER_SCI12_SCIX0=0x1E,IER_SCI12_SCIX1=0x1E,IER_SCI12_SCIX2=0x1E,IER_SCI12_SCIX3=0x1E,
IER_RIIC0_EEI0=0x1E,IER_RIIC0_RXI0=0x1E,IER_RIIC0_TXI0=0x1F,IER_RIIC0_TEI0=0x1F
} enum_ier_t;

typedef enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_FCU_FRDYI=2,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CAC_FERRF=32,IPR_CAC_MENDF=33,IPR_CAC_OVFF=34,
IPR_RSPI0_SPEI0=44,IPR_RSPI0_SPRI0=44,IPR_RSPI0_SPTI0=44,IPR_RSPI0_SPII0=44,
IPR_RSCAN_COMFRXINT=52,IPR_RSCAN_RXFINT=53,IPR_RSCAN_TXINT=54,IPR_RSCAN_CHERRINT=55,IPR_RSCAN_GLERRINT=56,
IPR_DOC_DOPCF=57,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_ELC_ELSR8I=80,
IPR_LVD_LVD1=88,IPR_LVD_LVD2=89,
IPR_S12AD_S12ADI0=102,IPR_S12AD_GBADI=103,
IPR_ELC_ELSR18I=106,IPR_ELC_ELSR19I=107,
IPR_MTU0_TGIA0=114,IPR_MTU0_TGIB0=114,IPR_MTU0_TGIC0=114,IPR_MTU0_TGID0=114,IPR_MTU0_TCIV0=118,IPR_MTU0_TGIE0=118,IPR_MTU0_TGIF0=118,
IPR_MTU1_TGIA1=121,IPR_MTU1_TGIB1=121,IPR_MTU1_TCIV1=123,IPR_MTU1_TCIU1=123,
IPR_MTU2_TGIA2=125,IPR_MTU2_TGIB2=125,IPR_MTU2_TCIV2=127,IPR_MTU2_TCIU2=127,
IPR_MTU3_TGIA3=129,IPR_MTU3_TGIB3=129,IPR_MTU3_TGIC3=129,IPR_MTU3_TGID3=129,IPR_MTU3_TCIV3=133,
IPR_MTU4_TGIA4=134,IPR_MTU4_TGIB4=134,IPR_MTU4_TGIC4=134,IPR_MTU4_TGID4=134,IPR_MTU4_TCIV4=138,
IPR_MTU5_TGIU5=139,IPR_MTU5_TGIV5=139,IPR_MTU5_TGIW5=139,
IPR_POE_OEI1=170,IPR_POE_OEI2=171,
IPR_TMR0_CMIA0=174,IPR_TMR0_CMIB0=174,IPR_TMR0_OVI0=174,
IPR_TMR1_CMIA1=177,IPR_TMR1_CMIB1=177,IPR_TMR1_OVI1=177,
IPR_TMR2_CMIA2=180,IPR_TMR2_CMIB2=180,IPR_TMR2_OVI2=180,
IPR_TMR3_CMIA3=183,IPR_TMR3_CMIB3=183,IPR_TMR3_OVI3=183,
IPR_DMAC_DMAC0I=198,IPR_DMAC_DMAC1I=199,IPR_DMAC_DMAC2I=200,IPR_DMAC_DMAC3I=201,
IPR_DSAD0_ADI0=206,IPR_DSAD0_SCANEND0=207,
IPR_DSAD1_ADI1=209,IPR_DSAD1_SCANEND1=210,
IPR_SCI1_ERI1=218,IPR_SCI1_RXI1=218,IPR_SCI1_TXI1=218,IPR_SCI1_TEI1=218,
IPR_SCI5_ERI5=222,IPR_SCI5_RXI5=222,IPR_SCI5_TXI5=222,IPR_SCI5_TEI5=222,
IPR_SCI6_ERI6=226,IPR_SCI6_RXI6=226,IPR_SCI6_TXI6=226,IPR_SCI6_TEI6=226,
IPR_SCI12_ERI12=238,IPR_SCI12_RXI12=238,IPR_SCI12_TXI12=238,IPR_SCI12_TEI12=238,IPR_SCI12_SCIX0=242,IPR_SCI12_SCIX1=243,IPR_SCI12_SCIX2=244,IPR_SCI12_SCIX3=245,
IPR_RIIC0_EEI0=246,IPR_RIIC0_RXI0=247,IPR_RIIC0_TXI0=248,IPR_RIIC0_TEI0=249,
IPR_BSC_=0,
IPR_FCU_=2,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_RSPI0_=44,
IPR_DOC_=57,
IPR_MTU1_TGI=121,
IPR_MTU1_TCI=123,
IPR_MTU2_TGI=125,
IPR_MTU2_TCI=127,
IPR_MTU3_TGI=129,
IPR_MTU4_TGI=134,
IPR_MTU5_=139,
IPR_MTU5_TGI=139,
IPR_TMR0_=174,
IPR_TMR1_=177,
IPR_TMR2_=180,
IPR_TMR3_=183,
IPR_SCI1_=218,
IPR_SCI5_=222,
IPR_SCI6_=226
} enum_ipr_t;


#pragma pack(4)


typedef struct st_afe {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short TEMPSEN : 1;
			unsigned short VREFEN : 1;
			unsigned short VBIASEN : 1;
			unsigned short IEXCEN : 1;
			unsigned short DSAD0EN : 1;
			unsigned short DSAD1EN : 1;
			unsigned short  : 9;
			unsigned short DSADLVM : 1;
#else
			unsigned short DSADLVM : 1;
			unsigned short  : 9;
			unsigned short DSAD1EN : 1;
			unsigned short DSAD0EN : 1;
			unsigned short IEXCEN : 1;
			unsigned short VBIASEN : 1;
			unsigned short VREFEN : 1;
			unsigned short TEMPSEN : 1;
#endif
	} BIT;
	} OPCR;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DET0LVL : 1;
			unsigned short  : 3;
			unsigned short DET1LVL : 2;
			unsigned short  : 2;
			unsigned short VR0PDISA : 1;
			unsigned short VR0PDISC : 1;
			unsigned short VR0NDISA : 1;
			unsigned short VR0NDISC : 1;
			unsigned short VR1PDISA : 1;
			unsigned short VR1PDISC : 1;
			unsigned short VR1NDISA : 1;
			unsigned short VR1NDISC : 1;
#else
			unsigned short VR1NDISC : 1;
			unsigned short VR1NDISA : 1;
			unsigned short VR1PDISC : 1;
			unsigned short VR1PDISA : 1;
			unsigned short VR0NDISC : 1;
			unsigned short VR0NDISA : 1;
			unsigned short VR0PDISC : 1;
			unsigned short VR0PDISA : 1;
			unsigned short  : 2;
			unsigned short DET1LVL : 2;
			unsigned short  : 3;
			unsigned short DET0LVL : 1;
#endif
	} BIT;
	} VDETCR;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short LVDET0 : 1;
			unsigned short LVDET1 : 1;
			unsigned short  : 2;
			unsigned short IEXC0DET : 1;
			unsigned short IEXC1DET : 1;
			unsigned short IEXC2DET : 1;
			unsigned short IEXC3DET : 1;
			unsigned short DS0PDET : 1;
			unsigned short DS0NDET : 1;
			unsigned short DS0RDET : 1;
			unsigned short  : 1;
			unsigned short DS1PDET : 1;
			unsigned short DS1NDET : 1;
			unsigned short DS1RDET : 1;
			unsigned short  : 1;
#else
			unsigned short  : 1;
			unsigned short DS1RDET : 1;
			unsigned short DS1NDET : 1;
			unsigned short DS1PDET : 1;
			unsigned short  : 1;
			unsigned short DS0RDET : 1;
			unsigned short DS0NDET : 1;
			unsigned short DS0PDET : 1;
			unsigned short IEXC3DET : 1;
			unsigned short IEXC2DET : 1;
			unsigned short IEXC1DET : 1;
			unsigned short IEXC0DET : 1;
			unsigned short  : 2;
			unsigned short LVDET1 : 1;
			unsigned short LVDET0 : 1;
#endif
	} BIT;
	} VDETER;
	char           wk2[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VBIASEN0 : 1;
			unsigned short VBIASEN1 : 1;
			unsigned short VBIASEN2 : 1;
			unsigned short VBIASEN3 : 1;
			unsigned short VBIASEN4 : 1;
			unsigned short VBIASEN5 : 1;
			unsigned short VBIASEN6 : 1;
			unsigned short VBIASEN7 : 1;
			unsigned short VBIASEN8 : 1;
			unsigned short VBIASEN9 : 1;
			unsigned short VBIASEN10 : 1;
			unsigned short VBIASEN11 : 1;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short VBIASEN11 : 1;
			unsigned short VBIASEN10 : 1;
			unsigned short VBIASEN9 : 1;
			unsigned short VBIASEN8 : 1;
			unsigned short VBIASEN7 : 1;
			unsigned short VBIASEN6 : 1;
			unsigned short VBIASEN5 : 1;
			unsigned short VBIASEN4 : 1;
			unsigned short VBIASEN3 : 1;
			unsigned short VBIASEN2 : 1;
			unsigned short VBIASEN1 : 1;
			unsigned short VBIASEN0 : 1;
#endif
	} BIT;
	} VBOSR;
	char           wk3[2];
	unsigned long  TC0R;
	unsigned long  TC1R;
	unsigned long  TC2R;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSWEN : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char LSWEN : 1;
#endif
	} BIT;
	} LSWC;
	char           wk4[3];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS00ISR;
	char           wk5[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS01ISR;
	char           wk6[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS02ISR;
	char           wk7[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS03ISR;
	char           wk8[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS04ISR;
	char           wk9[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 3;
			unsigned short TSEN : 1;
#else
			unsigned short TSEN : 1;
			unsigned short  : 3;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS05ISR;
	char           wk10[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS10ISR;
	char           wk11[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS11ISR;
	char           wk12[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS12ISR;
	char           wk13[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS13ISR;
	char           wk14[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS14ISR;
	char           wk15[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PSEL : 4;
			unsigned short NSEL : 4;
			unsigned short RSEL : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short RSEL : 4;
			unsigned short NSEL : 4;
			unsigned short PSEL : 4;
#endif
	} BIT;
	} DS15ISR;
	char           wk16[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CUR : 3;
			unsigned char  : 1;
			unsigned char MODE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char MODE : 1;
			unsigned char  : 1;
			unsigned char CUR : 3;
#endif
	} BIT;
	} EXCCR;
	char           wk17[3];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short IEXC0SEL : 4;
			unsigned short IEXC1SEL : 4;
			unsigned short IEXC2SEL : 4;
			unsigned short IEXC3SEL : 4;
#else
			unsigned short IEXC3SEL : 4;
			unsigned short IEXC2SEL : 4;
			unsigned short IEXC1SEL : 4;
			unsigned short IEXC0SEL : 4;
#endif
	} BIT;
	} EXCOSR;
} st_afe_t;

typedef struct st_bsc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char STSCLR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char STSCLR : 1;
#endif
	} BIT;
	} BERCLR;
	char           wk0[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IGAEN : 1;
			unsigned char TOEN : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char TOEN : 1;
			unsigned char IGAEN : 1;
#endif
	} BIT;
	} BEREN;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IA : 1;
			unsigned char TO : 1;
			unsigned char  : 2;
			unsigned char MST : 3;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char MST : 3;
			unsigned char  : 2;
			unsigned char TO : 1;
			unsigned char IA : 1;
#endif
	} BIT;
	} BERSR1;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 3;
			unsigned short ADDR : 13;
#else
			unsigned short ADDR : 13;
			unsigned short  : 3;
#endif
	} BIT;
	} BERSR2;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short BPRA : 2;
			unsigned short BPRO : 2;
			unsigned short BPIB : 2;
			unsigned short BPGB : 2;
			unsigned short BPHB : 2;
			unsigned short BPFB : 2;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short BPFB : 2;
			unsigned short BPHB : 2;
			unsigned short BPGB : 2;
			unsigned short BPIB : 2;
			unsigned short BPRO : 2;
			unsigned short BPRA : 2;
#endif
	} BIT;
	} BUSPRI;
} st_bsc_t;

typedef struct st_cac {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CFME : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CFME : 1;
#endif
	} BIT;
	} CACR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CACREFE : 1;
			unsigned char FMCS : 3;
			unsigned char TCSS : 2;
			unsigned char EDGES : 2;
#else
			unsigned char EDGES : 2;
			unsigned char TCSS : 2;
			unsigned char FMCS : 3;
			unsigned char CACREFE : 1;
#endif
	} BIT;
	} CACR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RPS : 1;
			unsigned char RSCS : 3;
			unsigned char RCDS : 2;
			unsigned char DFS : 2;
#else
			unsigned char DFS : 2;
			unsigned char RCDS : 2;
			unsigned char RSCS : 3;
			unsigned char RPS : 1;
#endif
	} BIT;
	} CACR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRIE : 1;
			unsigned char MENDIE : 1;
			unsigned char OVFIE : 1;
			unsigned char  : 1;
			unsigned char FERRFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char OVFFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char OVFFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char FERRFCL : 1;
			unsigned char  : 1;
			unsigned char OVFIE : 1;
			unsigned char MENDIE : 1;
			unsigned char FERRIE : 1;
#endif
	} BIT;
	} CAICR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRF : 1;
			unsigned char MENDF : 1;
			unsigned char OVFF : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char OVFF : 1;
			unsigned char MENDF : 1;
			unsigned char FERRF : 1;
#endif
	} BIT;
	} CASTR;
	char           wk0[1];
	unsigned short CAULVR;
	unsigned short CALLVR;
	unsigned short CACNTBR;
} st_cac_t;

typedef struct st_cmt {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short STR0 : 1;
			unsigned short STR1 : 1;
			unsigned short  : 14;
#else
			unsigned short  : 14;
			unsigned short STR1 : 1;
			unsigned short STR0 : 1;
#endif
	} BIT;
	} CMSTR0;
} st_cmt_t;

