aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx23e-a/register_access/gnuc/iodefine.h
typedef struct st_cmt0 {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CKS : 2;
			unsigned short  : 4;
			unsigned short CMIE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short CMIE : 1;
			unsigned short  : 4;
			unsigned short CKS : 2;
#endif
	} BIT;
	} CMCR;
	unsigned short CMCNT;
	unsigned short CMCOR;
} st_cmt0_t;

typedef struct st_crc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char GPS : 2;
			unsigned char LMS : 1;
			unsigned char  : 4;
			unsigned char DORCLR : 1;
#else
			unsigned char DORCLR : 1;
			unsigned char  : 4;
			unsigned char LMS : 1;
			unsigned char GPS : 2;
#endif
	} BIT;
	} CRCCR;
	unsigned char  CRCDIR;
	unsigned short CRCDOR;
} st_crc_t;

typedef struct st_dmac {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DMST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DMST : 1;
#endif
	} BIT;
	} DMAST;
} st_dmac_t;

typedef struct st_dmac0 {
	void          *DMSAR;
	void          *DMDAR;
	unsigned long  DMCRA;
	unsigned short DMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} DMTMD;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} DMINT;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DARA : 5;
			unsigned short  : 1;
			unsigned short DM : 2;
			unsigned short SARA : 5;
			unsigned short  : 1;
			unsigned short SM : 2;
#else
			unsigned short SM : 2;
			unsigned short  : 1;
			unsigned short SARA : 5;
			unsigned short DM : 2;
			unsigned short  : 1;
			unsigned short DARA : 5;
#endif
	} BIT;
	} DMAMD;
	char           wk2[2];
	unsigned long  DMOFR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} DMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} DMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} DMSTS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DISEL : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DISEL : 1;
#endif
	} BIT;
	} DMCSL;
} st_dmac0_t;

typedef struct st_dmac1 {
	void          *DMSAR;
	void          *DMDAR;
	unsigned long  DMCRA;
	unsigned short DMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} DMTMD;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} DMINT;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DARA : 5;
			unsigned short  : 1;
			unsigned short DM : 2;
			unsigned short SARA : 5;
			unsigned short  : 1;
			unsigned short SM : 2;
#else
			unsigned short SM : 2;
			unsigned short  : 1;
			unsigned short SARA : 5;
			unsigned short DM : 2;
			unsigned short  : 1;
			unsigned short DARA : 5;
#endif
	} BIT;
	} DMAMD;
	char           wk2[6];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} DMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} DMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} DMSTS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DISEL : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DISEL : 1;
#endif
	} BIT;
	} DMCSL;
} st_dmac1_t;

typedef struct st_doc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OMS : 2;
			unsigned char DCSEL : 1;
			unsigned char  : 1;
			unsigned char DOPCIE : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char DOPCFCL : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCIE : 1;
			unsigned char  : 1;
			unsigned char DCSEL : 1;
			unsigned char OMS : 2;
#endif
	} BIT;
	} DOCR;
	char           wk0[1];
	unsigned short DODIR;
	unsigned short DODSR;
} st_doc_t;

typedef struct st_dsad {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CLKDIV : 4;
			unsigned long  : 3;
			unsigned long LPMD : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long LPMD : 1;
			unsigned long  : 3;
			unsigned long CLKDIV : 4;
#endif
	} BIT;
	} CCR;
	char           wk0[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SCMD : 1;
			unsigned long  : 1;
			unsigned long SYNCST : 1;
			unsigned long  : 1;
			unsigned long TRGMD : 1;
			unsigned long  : 3;
			unsigned long CH0EN : 1;
			unsigned long CH1EN : 1;
			unsigned long CH2EN : 1;
			unsigned long CH3EN : 1;
			unsigned long CH4EN : 1;
			unsigned long CH5EN : 1;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long CH5EN : 1;
			unsigned long CH4EN : 1;
			unsigned long CH3EN : 1;
			unsigned long CH2EN : 1;
			unsigned long CH1EN : 1;
			unsigned long CH0EN : 1;
			unsigned long  : 3;
			unsigned long TRGMD : 1;
			unsigned long  : 1;
			unsigned long SYNCST : 1;
			unsigned long  : 1;
			unsigned long SCMD : 1;
#endif
	} BIT;
	} MR;
	char           wk1[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long CVMD : 1;
			unsigned long SDF : 1;
			unsigned long  : 1;
			unsigned long OSR : 3;
			unsigned long  : 5;
			unsigned long DISAP : 1;
			unsigned long DISAN : 1;
			unsigned long  : 2;
			unsigned long AVMD : 2;
			unsigned long AVDN : 2;
			unsigned long  : 8;
			unsigned long DISC : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long DISC : 2;
			unsigned long  : 8;
			unsigned long AVDN : 2;
			unsigned long AVMD : 2;
			unsigned long  : 2;
			unsigned long DISAN : 1;
			unsigned long DISAP : 1;
			unsigned long  : 5;
			unsigned long OSR : 3;
			unsigned long  : 1;
			unsigned long SDF : 1;
			unsigned long CVMD : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} MR5;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNY : 5;
			unsigned long CNX : 3;
			unsigned long  : 3;
			unsigned long CNMD : 1;
			unsigned long  : 4;
			unsigned long GAIN : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GAIN : 5;
			unsigned long  : 4;
			unsigned long CNMD : 1;
			unsigned long  : 3;
			unsigned long CNX : 3;
			unsigned long CNY : 5;
#endif
	} BIT;
	} CR5;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long START : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long START : 1;
#endif
	} BIT;
	} ADST;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STOP : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long STOP : 1;
#endif
	} BIT;
	} ADSTP;
	char           wk4[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DATA : 24;
			unsigned long OVF : 1;
			unsigned long ERR : 1;
			unsigned long  : 3;
			unsigned long CCH : 3;
#else
			unsigned long CCH : 3;
			unsigned long  : 3;
			unsigned long ERR : 1;
			unsigned long OVF : 1;
			unsigned long DATA : 24;
#endif
	} BIT;
	} DR;
	char           wk5[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DATA : 24;
			unsigned long OVF : 1;
			unsigned long ERR : 1;
			unsigned long  : 3;
			unsigned long CCH : 3;
#else
			unsigned long CCH : 3;
			unsigned long  : 3;
			unsigned long ERR : 1;
			unsigned long OVF : 1;
			unsigned long DATA : 24;
#endif
	} BIT;
	} AVDR;
	char           wk6[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ACT : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long ACT : 1;
#endif
	} BIT;
	} SR;
	char           wk7[12];
	unsigned long  OSR0;
	unsigned long  OSR1;
	unsigned long  OSR2;
	unsigned long  OSR3;
	unsigned long  OSR4;
	unsigned long  OSR5;
	char           wk8[72];
	unsigned long  GCR0;
	unsigned long  GCR1;
	unsigned long  GCR2;
	unsigned long  GCR3;
	unsigned long  GCR4;
	unsigned long  GCR5;
	char           wk9[8];
	unsigned long  OFCR0;
	unsigned long  OFCR1;
	unsigned long  OFCR2;
	unsigned long  OFCR3;
	unsigned long  OFCR4;
	unsigned long  OFCR5;
} st_dsad_t;

typedef struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 4;
			unsigned char RRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char RRS : 1;
			unsigned char  : 4;
#endif
	} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SHORT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SHORT : 1;
#endif
	} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTCST : 1;
#endif
	} BIT;
	} DTCST;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VECN : 8;
			unsigned short  : 7;
			unsigned short ACT : 1;
#else
			unsigned short ACT : 1;
			unsigned short  : 7;
			unsigned short VECN : 8;
#endif
	} BIT;
	} DTCSTS;
} st_dtc_t;

typedef struct st_elc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 7;
			unsigned char ELCON : 1;
#else
			unsigned char ELCON : 1;
			unsigned char  : 7;
#endif
	} BIT;
	} ELCR;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR4;
	char           wk1[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR8;
	char           wk2[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR10;
	char           wk3[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR12;
	char           wk4[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR15;
	char           wk5[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR18;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR19;
	char           wk6[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR24;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR25;
	char           wk7[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR28;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR29;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char MTU1MD : 2;
			unsigned char MTU2MD : 2;
			unsigned char MTU3MD : 2;
#else
			unsigned char MTU3MD : 2;
			unsigned char MTU2MD : 2;
			unsigned char MTU1MD : 2;
			unsigned char  : 2;
#endif
	} BIT;
	} ELOPA;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MTU4MD : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char MTU4MD : 2;
#endif
	} BIT;
	} ELOPB;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char CMT1MD : 2;
			unsigned char LPTMD : 2;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char LPTMD : 2;
			unsigned char CMT1MD : 2;
			unsigned char  : 2;
#endif
	} BIT;
	} ELOPC;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMR0MD : 2;
			unsigned char  : 2;
			unsigned char TMR2MD : 2;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char TMR2MD : 2;
			unsigned char  : 2;
			unsigned char TMR0MD : 2;
#endif
	} BIT;
	} ELOPD;
	char           wk8[6];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PSB : 3;
			unsigned char PSP : 2;
			unsigned char PSM : 2;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char PSM : 2;
			unsigned char PSP : 2;
			unsigned char PSB : 3;
#endif
	} BIT;
	} PEL0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PSB : 3;
			unsigned char PSP : 2;
			unsigned char PSM : 2;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char PSM : 2;
			unsigned char PSP : 2;
			unsigned char PSB : 3;
#endif
	} BIT;
	} PEL1;
	char           wk9[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SEG : 1;
			unsigned char  : 5;
			unsigned char WE : 1;
			unsigned char WI : 1;
#else
			unsigned char WI : 1;
			unsigned char WE : 1;
			unsigned char  : 5;
			unsigned char SEG : 1;
#endif
	} BIT;
	} ELSEGR;
	char           wk10[22];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR46;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR47;
} st_elc_t;

